"""
Программа принимает действительное положительное число ​ x и целое отрицательное число
y​ . Необходимо выполнить возведение числа ​ x в степень ​ y​ . Задание необходимо реализовать
в виде функции ​ my_func(x, y)​ . При решении задания необходимо обойтись без встроенной
функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с
помощью оператора **. Второй — более сложная реализация без оператора **,
предусматривающая использование цикла.
"""


# ______________________________ Вариант №1_______________________________

def degree(x, y):
    return x ** y


print(degree(4, -2))


# ______________________________Вариант №2_________________________________

def my_degree(x, y):
    a = x
    for i in range(abs(y) - 1):
        x = a * x
    if y > 0:
        return x
    if y < 0:
        return 1 / x
    if y == 0:
        return 1


print(my_degree(9, -2))
