"""
Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии
Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет
добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ,
выполнение программы завершается. Если специальный символ введен после нескольких чисел,
то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого
завершить программу.
"""


def my_sum():
    control = None
    result_sum = 0
    while not control:
        number = input('Введите строку чисел, разделенных пробелом или Q для выхода: ').split()
        subtotal = 0
        for el in range(len(number)):
            if number[el] == 'q' or number[el] == 'Q':
                control = True
                break
            else:
                subtotal = subtotal + int(number[el])
        result_sum = result_sum + subtotal
        print(f'Промежуточная сумма {result_sum}')
    print(f'Вы вышли из программы, окончательная сумма {result_sum}')


my_sum()
