"""
Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. Строки
необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.
"""

user_str = input('Введите несколько слов, разделённых пробелами: ')
for n, i in enumerate(user_str.split(), 1):
    print(n, i[:10])
