"""
*Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит информацию
об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара:
название, цена, количество, единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у
пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например
название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""

goods = int(input("Введите количество товара "))

n = 1
analytics = {'название': [], 'цена': [], 'количество': [], 'eд': []}
goods_list = []

while n <= goods:

    new_goods = {
        'название': input("Введите название "),
        'цена': int(input("Введите цену ")),
        'количество': int(input('Введите количество ')),
        'eд': input("Введите единицу измерения ")
    }

    for f in new_goods.keys():
        analytics[f].append(new_goods[f])

    goods_list.append((n, new_goods))
    n += 1

print(f'Вы ввели новый товар в количестве {n - 1} едениц.')
for i in goods_list:
    print(i)

print('Аналитека по базе: ')
for key, value in analytics.items():
    print(f'{key}: {value}')


