"""
Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. Требуется определить
номер дня, на который общий результат спортсмена составить не менее b километров. Программа должна
принимать значения параметров a и b и выводить одно натуральное число — номер дня.
"""

distance1 = int(input('Результат первого дня: '))
distance2 = int(input('Рекорд: '))
day = 1
while distance1 < distance2:
    distance1 = distance1 * 1.1
    day += 1
print('Рекорд достигнут за', day, 'дней тренировок')