"""
Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете
необходимо использовать формулу: (выработка в часах*ставка в час) + премия. Для выполнения расчета для конкретных
значений необходимо запускать скрипт с параметрами
"""
from sys import argv

script_name, production, hourly_rate, bonus = argv

print(int(production) * int(hourly_rate) + int(bonus))
