"""
Создать (не программно) текстовый файл со следующим содержимым:
One — 1
Two — 2
Three — 3
Four — 4
Необходимо написать программу, открывающую файл на чтение и считывающую построчно данные. При этом английские
числительные должны заменяться на русские. Новый блок строк должен записываться в новый текстовый файл.
"""
rus = {'One': 'Один', 'Two': 'Два', 'Three': 'Три', 'Four': 'Четыре'}
new_file = []
with open('file_4.txt') as my_f:
    for i in my_f:
        i = i.split(' ', 2)
        new_file.append(rus[i[0]] + ' — ' + i[2])
    print(new_file)

with open('file_4_new.txt', 'w') as my_f_2:
    my_f_2.writelines(new_file)
